                                        Working with Pandas Library in Python

                                                    Data Series

create and display a one-dimensional array-like object containing an array of data using Pandas module

In [1]:
import pandas as pd
f = pd.Series([1,2,3,4,5])
f

0    1
1    2
2    3
3    4
4    5
dtype: int64

convert a Panda module Series to Python list and it's type

In [6]:
print("Series")
print(type(f))

print("List")
print(type(f.tolist()))

Series
<class 'pandas.core.series.Series'>
List
<class 'list'>

In [ ]:
x = pd.Series([2, 4, 6, 8, 10])
y = pd.Series([1, 3, 5, 7, 9])
add = x + y
print("Add:")
print(add)
sub = x - y
print("Sub:")
print(sub)
mul = x * y
print("Mul:")
print(mul)
div = x / y
print("Div:")
print(div)

                                                        DataFrame

Create a dataframe from dictionary of values

In [123]:
import numpy as np
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
f = pd.DataFrame(exam_data,index=labels)
f

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

Display summary of the dataframe

In [124]:
f.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
attempts    10 non-null int64
name        10 non-null object
qualify     10 non-null object
score       8 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

First 3 rows of the dataframe

In [125]:
f[:3]

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

Subsetiing the dataframe using specified columns - 'name' , 'score'

In [126]:
f_new = f[['name','score']]
f_new

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

Selecting the rows[1,3,5,6] of the specific columns from the dataframe

In [127]:
f.ix[[1,3,5,6],['name','score']]

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

Rows and Columns count in the dataframe

In [128]:
print("Row Count")
print(f.shape[0])
print("Column Count")
print(f.shape[1])

Row Count
10
Column Count
4

Selecting the rows with Nan Values

In [129]:
f[f['score'].isnull()]

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

Selecting the rows with 'score' values between 15 and 20(both inclusive)

In [130]:
f[f['score'].between(15,20)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

Selecting the rows with 'attempts' < 2 and 'score' > 15

In [131]:
f[(f['score']>15) & (f['attempts']<2)]

   attempts   name qualify  score
j         1  Jonas     yes   19.0

Replacing NaN value in the 'score' column with 11.5 using 'loc'

In [132]:
f.loc['d','score']=11.5
f

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

Calculate sum of examination 'attempts'

In [133]:
f['attempts'].sum()

19

Adding the new row to the dataframe

In [134]:
f.loc['k'] = [1,"Suresh",'yes',15.5]
f

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0
k         1     Suresh     yes   15.5

Droping the newly added row in the dataframe

In [135]:
f = f.drop('k')
f

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

Change the 'qualify' column values from yes-True and no-False

In [136]:
f['qualify'] = f['qualify'].map({'yes':True,'no':False})
f

   attempts       name  qualify  score
a         1  Anastasia     True   12.5
b         3       Dima    False    9.0
c         2  Katherine     True   16.5
d         3      James    False   11.5
e         2      Emily    False    9.0
f         3    Michael     True   20.0
g         1    Matthew     True   14.5
h         1      Laura    False    NaN
i         2      Kevin    False    8.0
j         1      Jonas     True   19.0

Replacing the name 'James to 'Suresh' in the name column in the dataframe

In [137]:
f['name'] = f['name'].replace('James','Suresh')
f

   attempts       name  qualify  score
a         1  Anastasia     True   12.5
b         3       Dima    False    9.0
c         2  Katherine     True   16.5
d         3     Suresh    False   11.5
e         2      Emily    False    9.0
f         3    Michael     True   20.0
g         1    Matthew     True   14.5
h         1      Laura    False    NaN
i         2      Kevin    False    8.0
j         1      Jonas     True   19.0

Deleting the 'attempts' column from the dataframe

In [138]:
f = f.drop('attempts',1)
f

        name  qualify  score
a  Anastasia     True   12.5
b       Dima    False    9.0
c  Katherine     True   16.5
d     Suresh    False   11.5
e      Emily    False    9.0
f    Michael     True   20.0
g    Matthew     True   14.5
h      Laura    False    NaN
i      Kevin    False    8.0
j      Jonas     True   19.0

Adding a new column 'Color' in the dataframe

In [139]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
f['color'] = color
f

        name  qualify  score   color
a  Anastasia     True   12.5     Red
b       Dima    False    9.0    Blue
c  Katherine     True   16.5  Orange
d     Suresh    False   11.5     Red
e      Emily    False    9.0   White
f    Michael     True   20.0   White
g    Matthew     True   14.5    Blue
h      Laura    False    NaN   Green
i      Kevin    False    8.0   Green
j      Jonas     True   19.0     Red

Iterating over thr rows in the dataframe

In [142]:
for index,each in f.iterrows():
    print(each['name'],each['qualify'],each['score'],each['color'])

Anastasia True 12.5 Red
Dima False 9.0 Blue
Katherine True 16.5 Orange
Suresh False 11.5 Red
Emily False 9.0 White
Michael True 20.0 White
Matthew True 14.5 Blue
Laura False nan Green
Kevin False 8.0 Green
Jonas True 19.0 Red